--
title:  "1장 컴퓨터 구조 기본"
excerpt: "기본적으로 컴퓨터를 구성하는 부품인 메모리, cpu, 보조기억장치, 입출력장치, 시스템 버스의 역할를 간단하게 알아본다."

categories:
  - Computer Structure
tags:
  - [메모리, cpu, 보조기억장치, 입출력장치 , 시스템 버스]

toc: true
toc_sticky: true
 
date: 2024-07-27
last_modified_at: 2024-07-27
---

1.컴퓨터란? 명령어를 처리하는 기계이다. 컴퓨터는 0과1인 2진수로 이루어진 데이터와 명령어를 처리 할 수 있다.
컴퓨터의 핵심 구성요소 : CPU, 메모리, 보조기억장치, 입출력장치, 시스템 버스

2.CPU란? 명령어와 데이터를 읽어들여 필요한 계산을 하는 부품이다. 사람으로 따지면 각종 감각으로부터 들어온 정보를 해석하고 처리하는 두뇌와 같은 역할을 한다고 할수 있다. 
CPU는 다시 ALU와 레지스터, 제어장치로 이루어져 있다. 
ALU는 쉽게 말해 계산기이다. 컴퓨터 내부에서 일어나는 대부분의 계산을 수행한다.
레지스터는 CPU내부의 임시 저장 장치이다. 프로그램을 실행하는데 필요한 값들을 임시로 저장한다. CPU 안에는 여러개의 레지스터가 존재하고, 각기 다른 이름과 역할을 가지고 있다.
제어장치는 명령어를 해석하고 메모리 읽기와 쓰기 신호를 내보내는 장치이다. 

3.메모리란? 현재 실행되는 프로그램의 명령어와 데이터를 저장하는 부품이다. 즉 프로그램이 실행되려면 반드시 메모리에 저장되어 있어야 한다. 이때 저장된 값들을 효율적으로 불러오고 쓰기위해 데이터를 저장할 위치에 각각의 주소를 부여한 후 이 주소를 통해 메모리를 읽거나 불러올 수 있다.

4.보조기억장치란? 메모리는 가격이 비싸 저장용량이 적고, 전원이 꺼지면 메모리 안에 있던 데이터가 모두 사라진다는 약점이 있다. 따라서 이를 보완하기 위해 용량도 크며 전원이 꺼져도 저장된 내용을 잃지 않게하는 장치가 보조기억장치이다. 대표적인 보조기억 장치로는  usb가 있다.

5.입출력장치란? 컴퓨터 외부에 연결되어 컴퓨터 내부와 데이터를 주고받는 장치이다. 대표적으로 마이크, 스피커, 프린터, 마우스, 키보드 등등이 있으며 보조기억장치와 구분되지 않기도 한다

6.시스템 버스란? 위에서 말한 장치들이 데이터를 주고받기위한 길이 필요한데 이를 연결해주는 것이 시스템 버스이다. 사람으로 따지면 각종 장기를 연결해주는 혈관 같은셈. 이 시스템 버스는 주소가 이동되는 주소 버스, 데이터가 이동되는 데이터 버스. 제어 신호가 이동되는 제어 버스등이 있다.
